print ("Шляпка гриба, покрытая … кожиц..й, держится на … ножк.. . Снизу шляпка затянута … плёнкой. Когда её уберёшь, откроется нижняя … сторона шляпк.. .")

a = "Шляпка гриба, покрытая (b) кожиц(c)й, держится на (d) ножк(e). Снизу шляпка затянута (f) плёнкой. Когда её уберёшь, откроется нижняя (g) сторона шляпк(h) ."

b = input ('Вставьте слово: ')
print (b)

c = input ('Вставьте букву: ')
print (c)

d = input ('Вставьте слово: ')
print (d)

e = input ('Вставьте букву: ')
print (e)

f = input ('Вставьте слово: ')
print (f)

g = input ('Вставьте слово: ')
print (g)

h = input ('Вставьте букву: ')
print (h)

print (a)